20240405191551-hebbian_plasticity.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-08-18 So 10:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>hebbian-plasticity</title>
<meta name="author" content="Hugs" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="stylesheet.css"
</head>
<body>
<div id="preamble" class="status">
<!-- MailerLite Universal -->
<script>
    (function(w,d,e,u,f,l,n){w[f]=w[f]||function(){(w[f].q=w[f].q||[])
    .push(arguments);},l=d.createElement(e),l.async=1,l.src=u,
    n=d.getElementsByTagName(e)[0],n.parentNode.insertBefore(l,n);})
    (window,document,'script','https://assets.mailerlite.com/js/universal.js','ml');
    ml('account', '919123');
</script>
<!-- End MailerLite Universal -->
</div>
<div id="content" class="content">
<h1 class="title">hebbian-plasticity</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc12fb39">Hebbian plasticity encodes information efficiently</a></li>
<li><a href="#orgf007add">Hebbian plasticity allows forming associations</a></li>
<li><a href="#orgfbd8892">Hebbian plasticity allows memories to form</a></li>
</ul>
</div>
</div>
<p>
The majority of neurons in the brain emit the neurotransmitter Glutamate.
Although it can have other effects, the main effect of glutamate is relatively simple: it activates receptors which increase the electrical potential of the neuron.
This increase in electrical potential brings the targeted neuron closer to firing an action potential itself, thereby releasing its own neurotransmitter.
</p>


<p>
Donald Hebb hypothesized in 1949 that when a glutamate-emitting neuron consistently makes another one fire, the connection between them should be strengthened.
Remember that each neuron usually recieves input from hundreds or thousands of others.
If one neuron consistently takes part in firing another one, it does not do so alone.
This means that neurons which tend to fire at around the same time will be likely to both contribute to firing the same target neuron.
This leads each neuron to select inputs which tend to be active at the same time.
This kind of learning is usually summed up as "cells that fire together wire together", and the process is called Hebbian plasticity.
</p>

<div id="outline-container-orgc12fb39" class="outline-2">
<h2 id="orgc12fb39">Hebbian plasticity encodes information efficiently</h2>
<div class="outline-text-2" id="text-orgc12fb39">
<p>
One thing that hebbian plasticity does is that it creates the ability to more efficiently represent incoming data.
Think of it as a form of data compression.
For instance:
</p>

<p>
Imagine that you have a catalogue of images, each of which is a white background with a bunch of triangles on it.
&#x2013; TODO: images
Say you had a neural network look at these images with a hebbian learning rule, such that the inputs to the neurons are the intensity (or whiteness) of the pixels of the image.
Inputs from pixels in triangle formations would very often occur, and so the connectivity to neurons from groups of pixels in triangle formation would gradually become stronger.
Eventually, the neurons would in a way become 'triangle-selective', where they respond most strongly to triangle patterns.
Their activity therefore comes to represent the locations of triangles in the image, which is much more efficient than representing every single pixel directly.
Of course, this is a really simplistic example: real sensory data are way more diverse, and way more complex.
</p>
</div>
</div>

<div id="outline-container-orgf007add" class="outline-2">
<h2 id="orgf007add">Hebbian plasticity allows forming associations</h2>
<div class="outline-text-2" id="text-orgf007add">
<p>
Hebbian plasticity can use similar mechanisms to learn associations: for instance if a bell is rung and then a reward is given, then the neurons that tend to be active after a bell will form stronger connections with the neurons that are active when there is a reward.
Over time this process will lead to the bell itself activating the reward-coding neurons.
This makes sense for an organism: if you want a reward, you should seek out things that lead to rewards, not just the rewards themselves.
Besides rewards, a process like this could underlie associations we have between sounds or smells and times in our lives.
</p>
</div>
</div>

<div id="outline-container-orgfbd8892" class="outline-2">
<h2 id="orgfbd8892">Hebbian plasticity allows memories to form</h2>
<div class="outline-text-2" id="text-orgfbd8892">
<p>
We experience a memory as a set of associated experiences triggered by something that reminds us of them.
Maybe you can see how hebbian plasticity could contribute to this.
The neurons that were active at the same time during the event you remember will wire together more strongly, and any one part of that memory can activate the others and so recreate the whole.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<div class="ml-embedded" data-form="UcmPfz"></div>
       <script src="https://utteranc.es/client.js"
        repo="HDictus/HDictus.github.io"
        issue-term="title"
        theme="github-light"
        crossorigin="anonymous"
        async>
      </script>

      <a href="index.html"> home </a>
</div>
</body>
</html>